import { doc, setDoc } from "firebase/firestore";
import { db } from "../../../firebase"; // імпорт налаштування Firebase
import React from "react";

const AddAccessories = () => {
  const accessoriesData = [
    {
      id: "1001",
      name: "Ремінець шкіряний чорний 12*6 мм, 1001",
      unit: "Метр",
    },
    {
      id: "1002",
      name: "Ремінець шкіряний коричневий 12*6 мм, 1002",
      unit: "Метр",
    },
    {
      id: "1003",
      name: "Ремінець шкіряний чорний з широким плетінням 12*6 мм, 1003",
      unit: "Метр",
    },
    {
      id: "1004",
      name: "Ремінець шкіряний коричневий з широким плетінням 12*6 мм, 1004",
      unit: "Метр",
    },
    { id: "1005", name: "Ремінець шкіряний білий 12*6 мм, 1005", unit: "Метр" },
    {
      id: "1006",
      name: "Ремінець шкіряний зелений 12*6 мм, 1006",
      unit: "Метр",
    },
    { id: "1007", name: "Ремінець шкіряний чорний 8*4 мм, 1007", unit: "Метр" },
    { id: "1008", name: "Ремінець шкіряний білий 8*4 мм, 1008", unit: "Метр" },
    {
      id: "1009",
      name: "Ремінець шкіряний червоний 8*4 мм, 1009",
      unit: "Метр",
    },
    {
      id: "1010",
      name: "Ремінець шкіряний чорний 10*2.7 мм, 1010",
      unit: "Метр",
    },
    {
      id: "1011",
      name: "Ремінець шкіряний червоний наппа 10*2.7 мм, 1011",
      unit: "Метр",
    },
    {
      id: "1012",
      name: "Ремінець шкіряний чорний круглий 8 мм, 1012",
      unit: "Метр",
    },
    {
      id: "1013",
      name: "Ремінець шкіряний чорний наппа 10*2.7 мм, 1013",
      unit: "Метр",
    },
    {
      id: "2001",
      name: "Камінь Тигрове око (Бронзит) 8 мм, 2001",
      unit: "Метр",
    },
    { id: "2002", name: "Камінь Онікс (чорний) 8 мм, 2002", unit: "Метр" },
    { id: "2003", name: "Камінь Рожевий кварц 6 мм, 2003", unit: "Метр" },
    { id: "2004", name: "Камінь Рожевий кварц 8 мм, 2004", unit: "Метр" },
    { id: "2005", name: "Місячний камінь 6 мм, 2005", unit: "Метр" },
    { id: "2006", name: "Камінь Лабрадор 6 мм, 2006", unit: "Метр" },
    {
      id: "3001",
      name: "Застібка магнітна чорна матова 12*6 мм, 3001",
      unit: "Штука",
    },
    {
      id: "3002",
      name: "Застібка магнітна срібна матова 12*6 мм, 3002",
      unit: "Штука",
    },
    {
      id: "3003",
      name: "Застібка магнітна срібна глянцева 12*6 мм, 3003",
      unit: "Штука",
    },
    {
      id: "3004",
      name: "Застібка магнітна бронзова матова 12*6 мм, 3004",
      unit: "Штука",
    },
    {
      id: "3005",
      name: "Застібка магнітна золота глянцева 12*6 мм, 3005",
      unit: "Штука",
    },
    {
      id: "3006",
      name: "Застібка магнітна золота матова 12*6 мм, 3006",
      unit: "Штука",
    },
    {
      id: "3007",
      name: "Застібка магнітна срібна глянцева 8*4 мм, 3007",
      unit: "Штука",
    },
    {
      id: "3008",
      name: "Застібка магнітна срібна матова 8*4 мм, 3008",
      unit: "Штука",
    },
    {
      id: "3009",
      name: "Застібка магнітна золота глянцева 8*4 мм, 3009",
      unit: "Штука",
    },
    {
      id: "3010",
      name: "Застібка магнітна золота матова 8*4 мм, 3010",
      unit: "Штука",
    },
    {
      id: "3011",
      name: "Застібка магнітна чорна матова 8*4 мм, 3011",
      unit: "Штука",
    },
    {
      id: "3012",
      name: "Застібка кліпса з фіксатором срібна снейк 8 мм, 3012",
      unit: "Штука",
    },
    { id: "3013", name: "Застібка з регулюванням 8*4 мм, 3013", unit: "Штука" },
    {
      id: "3014",
      name: "Застібка з регулюванням 10*3 мм, 3014",
      unit: "Штука",
    },
    {
      id: "3015",
      name: "Застібка срібна глянцева з регулюванням 12*6 мм, 3015",
      unit: "Штука",
    },
    {
      id: "3016",
      name: "Застібка чорна матова з регулюванням 12*6 мм, 3016",
      unit: "Штука",
    },
    { id: "3017", name: "Застібка карабін лобстер 12 мм, 3017", unit: "Штука" },
    { id: "3018", name: "Застібка карабін лобстер 10 мм, 3018", unit: "Штука" },
    {
      id: "3019",
      name: "Застібка магнітна бронзова матова 8*4 мм",
      unit: "Штука",
    },
    {
      id: "4001",
      name: "Пластина срібна глянцева 40*8*4 мм, 4001",
      unit: "Штука",
    },
    {
      id: "4002",
      name: "Пластина срібна глянцева 40*10*3 мм, 4002",
      unit: "Штука",
    },
    {
      id: "4003",
      name: "Пластина срібна глянцева 38*12*6 мм, 4003",
      unit: "Штука",
    },
    {
      id: "4004",
      name: "Пластина чорна матова 38*12*6 мм, 4004",
      unit: "Штука",
    },
    {
      id: "4005",
      name: "Пластина чорна матова 18*12*6 мм, 4005",
      unit: "Штука",
    },
    {
      id: "4006",
      name: "Пластина срібна глянцева 18*12*6 мм, 4006",
      unit: "Штука",
    },
    {
      id: "4007",
      name: "Пластина срібна глянцева 8*12*6 мм, 4007",
      unit: "Штука",
    },
    {
      id: "4008",
      name: "Декоративні металеві вставки 8*4*3 мм, 4008",
      unit: "Штука",
    },
    {
      id: "4009",
      name: "Декоративні металеві вставки 10*3*5 мм, 4009",
      unit: "Штука",
    },
    {
      id: "4010",
      name: "Декоративні металеві вставки 12*6*3 мм, 4010",
      unit: "Штука",
    },
    { id: "5001", name: "Основа браслета з каменю, 5001", unit: "Метр" },
    { id: "5002", name: "Силіконове кільце 4*1,5 мм, 5002", unit: "Штука" },
    { id: "5003", name: "Силіконове кільце 5*1,5 мм, 5003", unit: "Штука" },
    { id: "5004", name: "Силіконове кільце 6*1,5 мм, 5004", unit: "Штука" },
    { id: "6001", name: "Ланцюжок якір 2 мм, 6001", unit: "Метр" },
    { id: "6014", name: "Ланцюжок колос 6 мм, 6014", unit: "Метр" },
    { id: "6002", name: "Ланцюжок колос 2,7 мм, 6002", unit: "Метр" },
    { id: "6003", name: "Ланцюжок куба 3,7 мм, 6003", unit: "Метр" },
    { id: "6004", name: "Ланцюжок куба 6 мм, 6004", unit: "Метр" },
    { id: "6005", name: "Ланцюжок куба 7 мм, 6005", unit: "Метр" },
    { id: "6006", name: "Ланцюжок куба 8 мм, 6006", unit: "Метр" },
    { id: "6007", name: "Ланцюжок куба подвійна 4 мм, 6007", unit: "Метр" },
    { id: "6008", name: "Ланцюжок куба подвійна 6 мм, 6008", unit: "Метр" },
    { id: "6009", name: "Ланцюжок куба подвійна 8 мм, 6009", unit: "Метр" },
    { id: "6010", name: "Ланцюжок якір 3 мм, 6010", unit: "Метр" },
    { id: "6011", name: "Ланцюжок якір 6 мм, 6011", unit: "Метр" },
    {
      id: "6012",
      name: "Ланцюжок для регулювання 3.6 мм, 6012",
      unit: "Штука",
    },
    { id: "6013", name: "Ланцюжок для регулювання 6 мм, 6013", unit: "Штука" },
    { id: "7001", name: "Елементи для зʼєднання - клей, 7001", unit: "Грам" },
    {
      id: "7002",
      name: "Елементи для зʼєднання - кільця 5*1 мм, 7002",
      unit: "Штука",
    },
    {
      id: "7003",
      name: "Елементи для зʼєднання - кільця 6*1 мм, 7003",
      unit: "Штука",
    },
    {
      id: "7004",
      name: "Елементи для зʼєднання - кільця 8*1,5 мм, 7004",
      unit: "Штука",
    },
    { id: "8001", name: "Кулон круглий 20 мм, 8001", unit: "Штука" },
    { id: "8002", name: "Кулон круглий 16 мм, 8002", unit: "Штука" },
    { id: "8003", name: "Кулон прямокутний, 8003", unit: "Штука" },
    { id: "8004", name: "Кулон стовбик, 8004", unit: "Штука" },
    { id: "8005", name: "Жетон 26*40 мм, 8005", unit: "Штука" },
    { id: "8006", name: "Конектор 22 мм круг, 8006", unit: "Штука" },
    { id: "8007", name: "Конектор 16 мм круг, 8007", unit: "Штука" },
    { id: "1101", name: "Браслет на шкіряній мотузці, 1101", unit: "Штука" },
    {
      id: "1102",
      name: "Браслет на чорній тонкій мотузці, 1102",
      unit: "Штука",
    },
    {
      id: "1103",
      name: "Браслет на чорній товстій мотузці, 1103",
      unit: "Штука",
    },
    {
      id: "1104",
      name: "Браслет на рожевій тонкій мотузці, 1104",
      unit: "Штука",
    },
    {
      id: "1105",
      name: "Браслет на сірій тонкій мотузці, 1105",
      unit: "Штука",
    },
    {
      id: "1106",
      name: "Браслет на червоній тонкій мотузці, 1106",
      unit: "Штука",
    },
    {
      id: "1107",
      name: "Браслет на червоній товстій мотузці, 1107",
      unit: "Штука",
    },
    {
      id: "9001",
      name: "Браслет панцерний срібний, 10 мм, 9001",
      unit: "Штука",
    },
    {
      id: "9002",
      name: "Браслет панцерний срібний, 15 мм, 9002",
      unit: "Штука",
    },
    {
      id: "9003",
      name: "Браслет панцерний чорний, 10 мм, 9003",
      unit: "Штука",
    },
    {
      id: "9004",
      name: "Браслет панцерний чорний, 15 мм, 9004",
      unit: "Штука",
    },
    {
      id: "9005",
      name: "Браслет панцерний чорний з синім, 9005",
      unit: "Штука",
    },
    {
      id: "9006",
      name: "Браслет панцерний чорний з золотим, 9006",
      unit: "Штука",
    },
    {
      id: "9007",
      name: "Браслет панцерний білий з золотим, 9007",
      unit: "Штука",
    },
    {
      id: "9008",
      name: "Інструмент для регулювання розміру, 9008",
      unit: "Штука",
    },
    {
      id: "9009",
      name: "Додаткові ланки для регулювання, 9009",
      unit: "Штука",
    },
    { id: "1201", name: "Запальничка, 1201", unit: "Штука" },
    { id: "1202", name: "Балон для запальнички, 1202", unit: "Штука" },
    { id: "1301", name: "Ремінь 120 см, 1301", unit: "Штука" },
    { id: "1302", name: "Ремінь 130 см, 1302", unit: "Штука" },
    { id: "1303", name: "Ремінь 140 см, 1303", unit: "Штука" },
    { id: "1304", name: "Ремінь 150 см, 1304", unit: "Штука" },
    { id: "1305", name: "Гаманець, 1305", unit: "Штука" },
    { id: "1306", name: "Портмоне, 1306", unit: "Штука" },
    {
      id: "1401",
      name: "Коробочка для браслетів / кулонів / каблучок, 1401",
      unit: "Штука",
    },
    { id: "1402", name: "Коробочка для запальничок, 1402", unit: "Штука" },
    { id: "1403", name: "Коробочка для комплектів, 1403", unit: "Штука" },
    { id: "1404", name: "Наповнювач паперовий", unit: "Грам" },
    { id: "1405", name: "Коробочка транспортувальна 10*9 мм", unit: "Штука" },
    { id: "1406", name: "Коробочка транспортувальна 10*9*5 см", unit: "Штука" },
    { id: "1407", name: "Додаткові коришечки для коробочок", unit: "Штука" },
    { id: "1408", name: "Пупирка", unit: "Метр" },
    { id: "1409", name: "Чорна плівка", unit: "Метр" },
    { id: "1501", name: "Конектор пазлик", unit: "Штука" },
    { id: "1502", name: "Конектор сердечко I love you", unit: "Штука" },
    { id: "1503", name: "Конектор літачок", unit: "Штука" },
    { id: "1504", name: "Магніт серце", unit: "Штука" },
  ];

  const addAccessoriesToFirebase = async () => {
    try {
      for (const accessory of accessoriesData) {
        const accessoryRef = doc(db, "accessories", accessory.id);
        await setDoc(accessoryRef, {
          ...accessory,
          criticalQuantity: 100,
          quantity: 101,
        });
        console.log(`Added accessory with ID: ${accessory.id}`);
      }
      alert("Дані успішно додані!");
    } catch (error) {
      console.error("Помилка при додаванні даних:", error);
      alert("Помилка при додаванні даних.");
    }
  };

  return (
    <div>
      <button onClick={addAccessoriesToFirebase}>Додати аксесуари</button>
    </div>
  );
};

export default AddAccessories;
